Revit 2027 API
BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForSwitchPanel Property
 The number of circuits on the switchboard currently exceeds the value you entered. Reduce the number of circuits on the equipment before changing this value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidNumberOfCircuitValueForSwitchPanel { get; }
Public Shared ReadOnly Property InvalidNumberOfCircuitValueForSwitchPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidNumberOfCircuitValueForSwitchPanel {
	FailureDefinitionId^ get ();
}
static member InvalidNumberOfCircuitValueForSwitchPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace